import { FieldDefinition } from '../types/fieldDefinitions';
import { Assignment } from '../types';

export const ASSIGNMENT_FIELDS: FieldDefinition<keyof Assignment>[] = [
  {
    key: 'hour',
    label: 'Брой часове за изпълнение на ангажимента',
    infoId: 'assignmenthour',
    info: 'На база на въведения брой часове, калкулаторът ще изчисли стойността на вашия хонорар',
  },
  {
    key: 'studioRent',
    label: 'Наем студио',
    infoId: 'assignmentstudiorent',
    info: 'Наем на студио за конкретния ангажимент. Студио, което е различно от вашето собствено, ако сте въвели разходите за такова, по-горе.',
  },
  {
    key: 'equipmentRent',
    label: 'Наем техника',
    infoId: 'assignmentequipmentrent',
    info: 'Наем на техника за конкретния ангажимент. Техника, различна от тази, която сте въвели по-горе, ако има такава.',
  },
  {
    key: 'lightingRent',
    label: 'Наем осветление',
    infoId: 'assignmentlightingrent',
    info: 'Наем за осветителна техника за конкретния ангажимент различна от вашата, ако има такъв.',
  },
  {
    key: 'makeupArtist',
    label: 'Гримьор',
    infoId: 'assignmentmakeupartist',
    info: 'Хонорарът на гримьор за конкретния ангажимент, ако има такъв.',
  },
  {
    key: 'hairdresser',
    label: 'Фризьор',
    infoId: 'assignmenthairdresser',
    info: 'Хонорарът на фризьор за конкретния ангажимент, ако има такъв.',
  },
  {
    key: 'stylist',
    label: 'Стилист',
    infoId: 'assignmentstylist',
    info: 'Хонорарът на стилист за конкретния ангажимент, ако има такъв.',
  },
  {
    key: 'assistant',
    label: 'Асистент/и',
    infoId: 'assignmentassistant',
    info: 'Хонорарът на асистент на фотографа за конкретния ангажимент, ако има такъв.',
  },
  {
    key: 'model',
    label: 'Модел/и',
    infoId: 'assignmentmodel',
    info: 'Хонорарът на модел за конкретния ангажимент, ако има такъв.',
  },
  {
    key: 'transport',
    label: 'Транспортни разходи',
    infoId: 'assignmenttransport',
    info: 'Разходите за транспорт за конкретния ангажимент. Ако използвате собствен автомобил, тук заложете реалния разход за гориво + %за амортизация на автомобила.',
  },
  {
    key: 'decor',
    label: 'Декори / реквизит',
    infoId: 'assignmentdecor',
    info: 'Разходите за декори, които са изработени или наети за конкретния ангажимент. Ако ползвате декори в студийната си работа, които вие правите, е по-добре да ги заложите по-горе, в годишините си разходи.',
  },
  {
    key: 'retouch',
    label: 'Ретуш',
    infoId: 'assignmentretouch',
    info: 'Ретуш, който се ползва като външна услуга и не се изпълнява от вас или ако е по-специален извън това, което нормално бихте направили.',
  },
  {
    key: 'authorsRights',
    label: 'Авторски права',
    infoId: 'assignmentauthorsrights',
    info: 'Авторските права или правата за ползване на вашата фотография, са важно перо в образуването на цената към клиента. Няма една формула, която да даде чисото в това поле. Неговото изчисляване е повод на създаване на отделен калкулатор. Важно е да знаете, че самото заснемане и цената му е едно нещо, а правото произведената фотография да се ползва с комерсиална цел е нещо съвсем отделно. Цената зависи от това за каква цел и за какъв период ще се ползва фотографията. До каква аудитория ще достигне тя. Работим по "формула" за изчисляване на стойността на авторските права, но дотогава ви препоръчваме да се консултирате с опитни колеги в бранша или с юристи с подходящия опит.',
  },
] as const;

