import { FieldDefinition } from '../types/fieldDefinitions';
import { YearlyExpenses } from '../types';

export const EXPENSE_FIELDS: FieldDefinition<keyof YearlyExpenses>[] = [
  {
    key: 'rentStudio',
    label: 'Наем офис / студио',
    infoId: 'yearlyrentstudio',
    info: 'Въведете разходите си за наем за една година. Ако работите от вкъщи не оставяйте това поле празно. Вие винаги имате среден годишен разход, за да ползвате жилището си като офис. Въведете него. Тук не се включват режийни разходи.',
  },
  {
    key: 'repairStudio',
    label: 'Ремонти работно помещение',
    infoId: 'yearlyrepairstudio',
    info: 'Заложете разумна сума на година за поддръжка на добрия вид на работното си място',
  },
  {
    key: 'phone',
    label: 'Телефон',
    infoId: '',
    info: '',
  },
  {
    key: 'internet',
    label: 'Интернет',
    infoId: '',
    info: '',
  },
  {
    key: 'electricity',
    label: 'Ток / вода / отопление',
    infoId: '',
    info: '',
  },
  {
    key: 'officeSupplies',
    label: 'Офис консумативи',
    infoId: '',
    info: '',
  },
  {
    key: 'website',
    label: 'Сайт / поддръжка',
    infoId: '',
    info: '',
  },
  {
    key: 'hosting',
    label: 'Хостинг',
    infoId: '',
    info: '',
  },
  {
    key: 'domain',
    label: 'Домейн',
    infoId: '',
    info: '',
  },
  {
    key: 'ads',
    label: 'Маркетинг и реклама',
    infoId: 'yearlyads',
    info: 'Въведете разходите, които правите за реклама за една година. Тук може да включите, както интернет реклама, така и разходи за подаръци на ваши клиенти, участия по изложения и др. Препоръчително е този разход да е около 10% от годишните ви приходи. Тази услуга може да се извършва и от външен доставчик.',
  },
  {
    key: 'accountant',
    label: 'Счетоводство',
    infoId: 'yearlyaccountant',
    info: 'За да можете да взимате пари за фотографския си труд, трябва да изберете подходящата форма на своята дейност. Дали ще работите като фирма (юридическо лице), физическо лице или свободна професия - всеки вариант има своите плюсове и минуси. Ако не сте наясно с тези понятия, то ви препоръчваме да се консултирате със счетоводител и задължително заложете разходи за счетоводство в сметките си.',
  },
  {
    key: 'lawyer',
    label: 'Правни услуги',
    infoId: 'yearlylawyer',
    info: 'Използването на правни услуги може да ви спести много главоболия и да ви помогне да защитавате по-добре интересите си. Може да се консултирате с адвокат по изготвянето на договори за различни поръчки или да ви се наложи да прибегнете до адвокатски услуги, ако някой използва неправомерно ваши фотографии. Хубаво е да заложите бюджет и за тези разходи.',
  },
  {
    key: 'training',
    label: 'Обучение',
    infoId: 'yearlytraining',
    info: 'Непрекъснатото развитие е изключително важно в упражняването на всяка една професия. Фотографията не прави изключение. Регулярното посещение на уъркшопи, фестивали, форуми и различни лекции ще ви държи будни и на гребена на вълната. Не оставяйте това поле празно.',
  },
  {
    key: 'photoworld',
    label: 'Годишно членство в клуб Photoworld',
    infoId: 'yearlyphotoworld',
    info: 'Слагаме това поле с леко намигване. Това да участвате и подкрепяте фотографските организации, сдружения, асоциации и общности е много важно. Вашето членство в тях може да ви донесе много ползи. Най-важното е, че по този начим подлкрепяте хора, които работят за развитието на българската фотография и помагат за вашето собствено развитие. В България има няколко по-сериозни организации, а спрямо интересите ви, може да потърсите подобни и в чужбина.',
  },
  {
    key: 'insurance',
    label: 'Застраховка',
    infoId: '',
    info: '',
  },
  {
    key: 'repairEquipment',
    label: 'Ремонти техника',
    infoId: 'yearlyrepairequipment',
    info: 'Всичко се случва. Предвидете бюджет за непредвидени ситуации. Повечето производители на фотографска техника имат и програми за професионалисти, които им дават възможност да ползват резервна техника в случаи на ремонт, както и по-кратки ремонтни срокове. Препоръчваме да ги проучите.',
  },
  {
    key: 'transport',
    label: 'Транспорт и/или автомобил',
    infoId: 'yearlytransport',
    info: 'Тук въведете годишните си разходи по поддръжка на собствен автомобил, ако го ползвате за работа: данъци, винетка, технически преглед, вноски, ако го изплащате. Ако нямате автомобил, може да въведете разходи за градски транспорт. В това поле не се опитвайте да смятате конкретни разходи за гориво. Тях ги има по-долу.',
  },
  {
    key: 'credits',
    label: 'Кредити',
    infoId: 'yearlycredits',
    info: 'Кредитът е един от начините да финансирате фотографската си дейност. Ако ползвате кредит, то задължително въведете вноските си по него, на годишна база тук. Ползвайте това поле за кредити, които плащат неща, които не влизат в полетата дотук. Ако сте купили техника на кредит, върнете се и проверете дали сте вкарали и лихвите по кредита към стойността на закупената техника.',
  },
  {
    key: 'investment',
    label: 'Инвестиции и развитие',
    infoId: 'yearlyinvestment',
    info: 'Това са парите, които заделяте за инвестиции в развитие на своята дейност. За закупуване на нова и по-скъпа техника, за наем на ново помещение и т.н',
  },
  {
    key: 'other',
    label: 'Други',
    infoId: 'yearlyother',
    info: 'В тази секция сме сложили основните разходи, които вярваме, че има при практикуването на почти всеки вид фотография. Вашата дейност, може да включва и много други или различни разходи, които не са включени в полетата по-горе. Помислете за всичко, което ви се налага да плащате и го заложете като допълнителен разход тук. Помнете, че става дума за разходи за една година.',
  },
] as const;

